Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The exercise provides knowledge of the practical management of operations in the air at the TAF level in an international context.
nb: Denne øvelsen skal gi kunnskap om praktisk ledelse av luftoperasjoner på taktisk nivå i en internasjonal kontekst.

source: operate turbo engines in a safe manner in a simulator and in the laboratory.
nb: operere turbomaskiner på sikker måte i simulator og i laboratoriet.

source: dimension machine parts against yield, buckling, fatigue, creep and cracks.
nb: dimensjonere maskindeler mot flyting, knekking, utmatting, siging og sprekkvekst.

source: • demonstrate understanding of the application and significance of physics for engineering problems
nb: • vise forståelse for fysikkens anvendelse og betydning på ingeniørfaglige problemstillinger

source: Lubricant oil systems in combustion engines, system oil and cylinder lubrication.
nb: Smøreoljesystemer i forbrenningsmotorer, systemolje og sylindersmøring.

source: describe the legal, financial and environmental consequences of military operations and implement this knowledge through his/her work as an officer.
nb: beskrive juridiske, økonomiske og miljømessige konsekvenser av militær virksomhet og realisere denne kunnskapen gjennom sitt virke som offiser.

source: • Structure of signal
nb: • Oppbygning av signal

source: This includes knowledge of one's personal character, branch, theoretical knowledge, knowledge of gouverning documents in the Armed Forces and cultural aspects.
nb: Dette inkluderer kunnskap om ens personkarakter, bransje, teoretisk kunnskap, kunnskap om styrkende dokumenter i Forsvaret og kulturelle forhold.

source: Lectures (lectures in digital techniques will be performed online) and compulsory exercises weekly.
nb: Forelesninger (i delemne digitalteknikk vil undervisningen foregå online) og ukentlige obligatoriske øvinger.

source: We discuss how military force can best be used for effective protection of civilians.
nb: Vi diskuterer hvordan militærmakt best kan benyttes for effektiv beskyttelse av sivile.

source: Today, the MPN voyage is divided into four phases, which are repeated from leg to leg of the voyage.
nb: I dag er seilasen i MPN delt opp i fire faser som gjentar seg fra seilaslegg til seilaslegg.

source: Naval rules and regulations, UVB building regulations and classifications rules from DNV GL on naval material certificates and qualities.
nb: Det sjømilitære NRaR– regelverket, UVB byggeforskrift og klasseregler fra DNV GL om marine materialsertifikater og kvaliteter.

source: The number includes reading / written commenting on the thesis, other preparations, and up to 10 hours of direct student contact.
nb: Tallet inkluderer lesing/skriftlig kommentering av oppgaven, øvrige forberedelser, samt opptil 10 timer direkte studentkontakt.

source: The purpose here is to provide the cadets with an understanding of self-perception, identity and personality as a human and leader.
nb: Hensikten er å gi kadettene kunnskap om selvoppfatning, identitet og personlighet som menneske og leder.

source: Lectures, assignments solving individually and/or in groups, plenary/group discussions and conversations and possibly different training arenas/exercises
nb: Forelesninger, oppgaveløsning individuelt og/eller i grupper, plenum-/gruppediskusjoner og samtaler og evt ulike treningsarenaer/øvelser

source: Through the use of various learning and reflection methods in the forefront, during and after practice, individual and collective learning and development (learning skills) are strengthened.
nb: Ved bruk av forskjellige lærings- og refleksjonsmetoder i forkant, underveis og i etterkant av praksis forsterkes individuell og kollektiv læring og utvikling (læringskompetanse).

source: Account for stress reactions and coping with stress at the individual, group and organisational levels.
nb: gjøre rede for stressreaksjoner og mestring av stress på individ, gruppe- og organisasjonsnivå.

source: provide examples of the Navy’s regulations on the subject and its concepts for maintenance and organisation.
nb: gi eksempler på Sjøforsvarets regelverk innen emnet og dets konsepter for vedlikehold og organisering.

source: The latter states that the school is subject to military command, disciplinary authority and rules for admission to and appointment from military schools.
nb: Av sistnevnte fremkommer det at skolen er underlagt militær kommando, disiplinærmyndighet og regler for opptak til og beskikkelse fra militære skoler.

source: • Voltage and current path in RC and RL circuits
nb: • Spennings- og strømforløp i RC- og RL-ledd

source: Great emphasis is placed on the student's ability to verbally and in writing (Norwegian and English) dissemination of products.
nb: Det legges stor vekt på studentens evne til muntlig og skriftlig (norsk og engelsk) formidling av produkter.

source: The course topic course and speed is taken from the ARPA course.
nb: Delemnet relativ kurs og fart er tatt ut av ARPA kurset og således en del av ARPA kurset.

source: The candidate can also contribute to new ways of thinking, and innovative and effective solutions, also when in stressful situations and with inadequate resources.
nb: Kandidaten kan dessuten bidra til nytenkning, innovative og effektive løsninger, også under stressede situasjoner og ved mangel på ressurser.

source: The course is coordinated with other courses that deal with data communication, modelling, programming, measuring and controlling.
nb: Emnet koordineres med andre emner som omhandler datakommunikasjon, modellering, programmering, måling og styring.

source: Subject 2: The RNAF as an educational organisation.
nb: Tema 2: Luftforsvaret som en lærende organisasjon.

source: Part 1 Equipment and manoeuvring
nb: Del 1 Utrustning og manøvrering

source: handle control and monitoring of the vessels’ technical ship systems and auxiliary systems at a lower level (manual/local) in the event of loss of automatic control or network.
nb: håndtere styring og overvåkning av fartøyenes skipstekniske systemer og hjelpesystemer på lavere nivå (manuell/lokal) ved bortfall av automatisk styring eller nettverk.

source: apply vulnerability mapping tools, techniques, penetration testing, digital forensics and analysis of malicious software
nb: anvende verktøy og teknikker for sårbarhetskartlegging, penetrasjonstesting, digital etterforskning og analyse av ondsinnet programvare

source: apply theories and methods to explore issues within organisation and management of organisations
nb: anvende teorier og metoder for å belyse problemstillinger innen organisasjon og ledelse av organisasjoner

source: explain the role and assignments of the troop commander and the conditions under which these should be performed.
nb: forklare troppssjefens rolle og oppgaver og under hvilke forhold disse skal utføres.

source: Know the challenges associated with the construction of field roads related to mobility, drainage, landslides, and floods.
nb: Kjenne til utfordringer knyttet til bygging av feltveier knyttet til tele, drenering, skred og flom.

source: The course comprises two parts where machine construction is 7.5 credits and materials science is 5 credits.
nb: Emnet består av to deler der maskinkonstruksjon er 7,5 stp. og materiallære er 5 stp.

source: describe the structure and operation of electrical installations on naval vessels
nb: beskrive oppbygning og virkemåte for elektriske anlegg på marinens fartøy

source: describe technological problems through mathematical models.
nb: beskrive teknologiske problem ved matematiske modeller.

source: • perform calculations in connection with the topics in the chemistry section
nb: • utføre beregninger i forbindelse med temaene i kjemidelen

source: Norwegian security, foreign, and defence policy
nb: Norsk sikkerhets-, utenriks-, og forsvarspolitikk

source: Bachelor’s degree in military studies with specialisation in management - Naval Engineer Weapon Systems, electronics and data (180 credits) comprises all courses under engineering basis, programme basis and technical specialisation and the common courses Basic Officer Competence, the Officer as a Leader and Military Problem-Solving and Methods.
nb: Bachelor i militære studier med fordypning i ledelse - marineingeniør våpensystemer, elektronikk og data (180 sp.) består av alle emner under ingeniørfaglig basis, programfaglig basis og teknisk spesialisering samt fellesemnene Grunnleggende offiserskompetanse, Offiseren som leder og Militær problemløsning og metode.

source: Key ethical dilemmas and issues will be highlighted as part of these historical analyses.
nb: Sentrale etiske dilemmaer og problemstillinger vil bli belyst som del av disse historiske analysene.

source: 3000 words, where the student defines a suitable NATO topic.
nb: 3000 ord, der studenten definerer sin eget tema innenfor NATO.

source: ILS concepts and the necessity of ILS in equipment procurements
nb: ILS begreper og nødvendigheten av ILS i materiellanskaffelser

source: Napier's rules in navigation - Vertex
nb: Napiers regler i navigasjon - Vertex

source: • calculate with symbols and formulas
nb: • regne med symboler og formler

source: Since joint operations and joint operational thinking (
nb: I og med at fellesoperasjoner og fellesoperativ tenkning (

source: • Arrays, strings and pointers
nb: • Arrayer, strenger og pekere

source: • reflect on society's expectations of the cyber engineer
nb: • reflektere over samfunnets forventninger til cyberingeniøren

source: The training period provides knowledge about, and experience of, the tasks and demands on the role of the platoon commander and co-operations officer in the context of one’s own combat arms.
nb: Praksisperioden tilfører kunnskap om de oppgaver og krav som stilles til troppssjefsrollen og samvirkeoffiseren i eget våpen.

source: contribute to new ways of thinking, innovation and entrepreneurship through participation in the development and realisation of sustainable and socially beneficial products, systems and/or solutions.
nb: bidra til nytenkning, innovasjon og entreprenørskap gjennom deltakelse i utvikling og realisering av bærekraftige og samfunnsnyttige produkter, systemer og/eller løsninger.

source: Sensor Systems also covers Kjerstad, Part 1, chapter 2.2: The basic concepts of electronics and radio technology.
nb: Sensorsystemer dekker også Kjerstad Del 1 kapittel 2.2 Elektro- og radiotekniske grunnbegreper.

source: The course is coordinated with Workshop training/Sailing periods, Naval architecture, Machine elements and materials science, Marine cybernetics, control and HMI and Marine engineeering systems and survivability.
nb: Emnet koordineres med Verkstedopplæringen/Seilasperioder, Marinefartøy flyteevne og konstruksjon, Maskinkonstruksjon og materilallære, Skipsteknisk styring, regulering og HMI samt Marine maskinerisystemer og overlevelsesevne.

source: utilise idiomatic structures in English both in writing and orally, is able to recognise and transfer relevant learning between different contexts
nb: benytte idiomatiske strukturer på engelsk både skriftlig og muntlig, og kan gjenkjenne samt overføre relevant læring mellom ulike kontekster

source: • Lows for calculating charging, current, voltage, power and equivalents in DC and AC circuits
nb: • Lover for beregning av ladning, strøm, spenning, effekt og ekvivalenter i DC- og AC-kretser

source: analyse the Norwegian Armed Forces Land Operations Doctrine’s (FDLO) theoretical platform.
nb: analysere Forsvarets doktrine for landoperasjoners (FDLO) teoretiske plattform.

source: use relevant computer tools to analyse basic and more advanced conditions
nb: bruke relevant dataverktøy til å analysere grunnleggende og mer avanserte forhold

source: knowledge of the effect of loading and unloading operations on trim and stability
nb: kjennskap til virkning laste- og losseoperasjoner har på trim og stabilitet

source: apply methods in digital technology and programming.
nb: anvende metoder i digitalteknikk og programmering.

source: use a relevant concept and system of formulae
nb: bruke relevant begreps- og formelapparat.

source: account for central theories on stress and motivation, including combat reactions and fighting spirit/morale
nb: gjøre rede for sentral teori innen stress og motivasjon, herunder stridsreaksjoner og kampmotivasjon.

source: use data tools to produce technical drawings in 2D and 3D format and perform simple strength analyses of simple geometries.
nb: nytte dataverktøy for framstilling av tekniske tegninger i 2D og 3D format samt foreta enkel styrkeanalyse av enkle geometrier.

source: The formal theory and methodology of the Norwegian Armed Forces’ service in peace and in war, and be able to identify the strengths and weaknesses of these.
nb: vitenskapelig teori og metode, Forsvarets freds- og krigsstabstjeneste og kunne forstå styrker og svakheter ved disse.

source: The study follows the Regulations for Admission, Studies and Examinations at the Norwegian Defence University College.
nb: Studiet følger forskrift om opptak, studier og eksamen ved Forsvarets høgskole.

source: The course follows STCW code tables A-III/1 and A-III/2 and the STCW function marine engineering at the management level.
nb: Emnet følger STCW-kode A-III/1 og A-III/2 og STCW-funksjon Maskineri på ledelsesnivå.

source: Ball and roller bearings, journal bearings.
nb: Kule og rullelager, glidelager.

source: Handouts for laboratory work and simulator excercises.
nb: Utlevert underlag ifm laboratorie- og simulatorøvelser.

source: Subject 3: Leadership in crises.
nb: Tema 3: Lederskap i kriser.

source: select and apply theoretical and practical management tools, as well as reflect upon his/her leadership skills in order to anticipate, master and exploit changing conditions and situations.
nb: velge og anvende teoretiske og praktiske ledelsesverktøy, samt reflektere over sitt lederskap for å kunne forutse, mestre og utnytte endrede forutsetninger og situasjoner.

source: Explain the combat arms’, platoon’s, and your own role and responsibilities.
nb: forklare våpenets, avdelingens, og egen rolle og oppgaver.

source: Dislocations, strengthening of metals, heat treatment.
nb: Dislokasjoner, styrking av metaller, varmebehandling.

source: reflect critical, independently, and constructive on operational art as expressed in theory, doctrines and operations.
nb: reflektere selvstendig, kritisk og konstruktivt rundt operasjonskunst som teori, doktrine og operasjoner.

source: • perform simple test and measurement exercises
nb: • utføre enkle test- og måleøvelser

source: Explain how the situation affects your own leadership and command.
nb: Forklare hvordan situasjonen påvirker egen ledelse og lederskap.

source: calculate thermodynamic conditions and efficiency levels for cooling systems and air treatment systems.
nb: beregne termodynamiske tilstander og virkningsgrader for kuldeanlegg og luftbehandlingsanlegg.

source: knowledge of how radar and ARPA function
nb: kjennskap til virkemåten for radar og ARPA

source: The subject will help consolidate the ability to lead and express yourself in English in an international context, as well as emphasizing the importance of being aware of the connection between physical and mental resilience when out in the field of international operations over a period of time.
nb: Temaet skal bidra til å styrke kompetansen på å lede og uttrykke seg på engelsk i en internasjonal kontekst, samt viktigheten av å se sammenhengen mellom fysisk og mental robusthet når man er ute i internasjonale operasjoner over tid.

source: For the industry Mission Support, the course is conducted at the Air Force's Flight Tactical Training Center (LFTS) at Rygge.
nb: For bransjen Mission Support gjennomføres emnet ved Luftforsvarets flytaktiske treningssenter (LFTS) på Rygge.

source: The central starting point will be an analysis of NATO's Allied Joint Doctrine for Operational-Level Planning (AJP-5), where the students will discuss and problematise key concepts and subprocesses along the road from understanding the operational mission to the response options which can be chosen and developed.
nb: Det sentrale utgangspunkt vil være en analyse av NATOs doktrine for planlegging av operasjoner (AJP-5), der studentene vil diskutere og problematisere sentrale begreper og delprosesser på veien mot å forstå problemet og det tilhørende militære oppdraget, og hvilke handlingsalternativer som kan utvikles og velges.

source: Lectures, tests, exercises, report writing and problem solving in groups
nb: Forelesninger, prøver, øvinger, rapportskriving og løsning av problemstillinger i grupper

source: Based on relevant research in logistics and Defence Supply Chain Management, relevant doctrines and concepts, as well as experience-based knowledge, the module addresses how logistics is planned, managed and carried out during formations and during military operations.
nb: Med basis i relevant forskning innen logistikk og Defence Supply Chain Management, relevante doktriner og konsepter samt erfaringsbasert kunnskap tar modulen for seg hvordan logistikk planlegges, ledes og gjennomføres under styrkeoppbygging og under militære operasjoner.

source: describe how GIS can be used to provide decision support and assignment support
nb: beskrive hvordan GIS kan brukes for å gi beslutnings- og oppdragsstøtte

source: Explain the dynamics of technological innovation, and explain the implications this has for military operations.
nb: forklare dynamikken i teknologisk innovasjon og forklare konsekvensene dette har for militære operasjoner.

source: Is this true, and why is it possible?
nb: Stemmer dette, og hvorfor er det eventuelt slik?

source: According to the course program for the different types of aircraft at the respective educational institutions in the US Air Force, US Navy and US Army.
nb: I henhold til kursprogram for de ulike flytyper ved de respektive utdanniningsinstitusjoner i US Air Force, US Navy og US Army.

source: The syllabus can be selected from the described support literature for FOPS 1 and / or 2, or other literature.
nb: Pensum kan velges fra beskrevet støttelitteratur for FOPS 1 og/eller 2, eller annen litteratur.

source: knowledge of research and development work within his / her subject area, as well as relevant methods and working methods within the electrical, information and communication technology subject.
nb: kjennskap til forsknings- og utviklingsarbeid innenfor sitt fagområde, samt relevante metoder og arbeidsmåter innenfor elektro-, informasjons- og kommunikasjonsteknologifaget.

source: In course 1, the development of the officer primarily concerns identifying the demands imposed on the role and function of the officer, in addition to identifying and experiencing military leadership in practice.
nb: I emne 1 handler offisersutviklingen først og fremst om å identifisere de krav som stilles til offiseren rolle og funksjon, samt identifisere og oppleve militært lederskap i praksis.

source: The course will be completed with a combination of digital and physical lectures, depending on the current Covid-19 situation.
nb: Emnet planlegges gjennomført med en kombinasjon av digital og fremmøtebasert undervisning, avhengig av den gjeldende Covid-19-situasjonen.

source: Management and operation of cooling systems and air treatment systems with associated auxiliary systems on simulator and in laboratory.
nb: Operasjon og drift av kuldeanlegg og luftbehandlingsanlegg med tilhørende hjelpesystemer på simulator og i laboratoriet.

source: Subject 1: Organisational understanding, organisational education and the management of change in the RNAF.
nb: Tema 1: Organisasjonsforståelse, organisasjonslæring og endringsledelse i Luftforsvaret.

source: design and conduct an academic level historical research project
nb: designe og gjennomføre et akademisk historisk forskningsprosjekt

source: explain key concepts and methods in digital technology, microprocessor programming and high-level programming
nb: forklare sentrale begreper og metoder i digitalteknikk, mikroprosessorprogrammering og høynivåprogrammering

source: calculate thermodynamic and fluid dynamic conditions in flow engines.
nb: beregne termodynamiske og fluiddynamiske tilstander i strømningsmaskiner.

source: The exercise will be an arena for the practical training of leadership and air power in demanding conditions.
nb: Øvelsen vil være en arena for praktisk trening av lederskap og luftmakt under ulike forhold.

source: Operating issues and HSE matters.
nb: Driftsproblematikk og HMS forhold.

source: - The students will to a greater extent themselves have to develop and work on relevant issues and obtain relevant curriculum.
nb: Studentene vil i større grad selv måtte utvikle og jobbe med relevante problemstillinger og fremskaffe relevant pensum.

source: The course also provides the cadets with an introduction to Norwegian security and defence policy, including key international and legal frameworks for Norwegian security and the use of military force.
nb: Emnet gir kadettene en innføring i norsk sikkerhets- og forsvarspolitikk, herunder sentrale internationale og rettslige rammer for norsk sikkerhet og bruk av militærmakt.

source: During this course the students will be able to plan, establish, adapt, operate and protect military information and communication systems.
nb: Gjennom emnet blir studentene i stand til å planlegge, etablere, tilpasse, drifte og beskytte militære informasjons- og kommunikasjonssystemer.

source: describe some concepts and relationships in ballistics.
nb: beskrive generelle begreper og sammenhenger innen ballistikk.

source: calculate forces on cogwheels and gears.
nb: beregne krefter på tannhjul og gir.

source: The course is coordinated with MPN, the Grimstadfjord exercise, the ECDIS assistant course and the Blindleia exercise.
nb: Emnet er koordinert med MPN, Øvelse Grimstadfjord, ECDIS assistentkurs og Øvelse Blindleia.

source: Therefore, the training in GSF-O and GLF-O must be carried out with a focus on increased awareness in order to understand the role and function of the officer, as well as the demands imposed on the officer.
nb: Utdanningen i GSF-O og GLF-O må dermed gjennomføres med fokus på økt bevissthet for å forstå offiserens rolle og funksjon, samt de krav som stilles til offiseren.

source: describe cultural frames of reference and their significance for military operations and international cooperation.
nb: beskrive kulturelle referanserammer og deres betydning for militære operasjoner og internasjonalt samarbeid.

source: Chapter 1.1.3 Reporting in accordance with the general principles and criteria for ship reporting systems
nb: kapittel 1.1.3 Rapportering iht retningslinjene og kriteria for fartøy rapporteringssystemer

source: Mass forces in and from rotating parts in turbo engines.
nb: Massekrefter i og fra roterende deler i turbomaskiner.

source: If linear algebra is failed, resit will be a 4-hour examination that counts for 1/3 of the overall grade.
nb: Hvis stryk i lineær algebra, vil kontinuasjon være en 4 timers deleksamen som teller som hele denne 1/3 av totalkarakteren.

source: Lectures, compulsory project work and compulsory exercises.
nb: Forelesninger, obligatorisk prosjektarbeid og obligatorisk øving.

source: ) Regulations on Qualifications and Certificates for Seafarers.
nb: ) Forskrift om kvalifikasjoner og sertifikater for sjøfolk.

source: The subject will thus provide cadets with more perspectives on management.
nb: Stridskurset avsluttes med individuell og lagsvis etterarbeid og refleksjon.
